app/services/price_calculator.rb

  def self.calculate(dish, customizations)
    base_price = dish.base_price
    adjustments = 0.0

    customizations.each do |ingredient_id, customization|
      ingredient_id = ingredient_id.to_i
      dish_ingredient = dish.dish_ingredients.find_by(ingredient_id: ingredient_id)
---
SELECT "dish_ingredients".* FROM "dish_ingredients" WHERE "dish_ingredients"."dish_id" = $1 AND "dish_ingredients"."ingredient_id" = $2 LIMIT $3  [["dish_id", 6], ["ingredient_id", 1], ["LIMIT", 1]]