app/controllers/api/dishes_controller.rb

SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def calculate_price
      dish = Dish.find(params[:id])