app/views/stories/_story.html.erb

      <!-- Fallback to story image, then dish image when no media items -->
      <% dish = story.dish || story.restaurant.dishes.first %>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" IN (SELECT DISTINCT "stories"."restaurant_id" FROM "stories") ORDER BY "restaurants"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1 ORDER BY "dishes"."id" ASC LIMIT $2  [["restaurant_id", 1], ["LIMIT", 1]]

  <!-- Bottom Action Bar -->
  <% dish = story.dish || story.restaurant.dishes.first %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1 ORDER BY "dishes"."id" ASC LIMIT $2  [["restaurant_id", 1], ["LIMIT", 1]]

<!-- Customization Panel -->
<% dish = story.dish || story.restaurant.dishes.first %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1 ORDER BY "dishes"."id" ASC LIMIT $2  [["restaurant_id", 1], ["LIMIT", 1]]