app/views/stories/edit.html.erb

SELECT "dishes".* FROM "dishes"
---
      <%= form.label :dish_id, "Dish (Optional - for customization)" %>
      <%= form.collection_select :dish_id, Dish.all, :id, :name, { include_blank: "None" }, { class: 'form-control' } %>

SELECT "media_items".* FROM "media_items" WHERE "media_items"."story_id" = $1 ORDER BY "media_items"."position" ASC  [["story_id", 9]]
---
    <div class="media-items-list">
      <% @story.media_items.order(:position).each do |media_item| %>