app/views/stories/index.html.erb

    <% if @stories.any? %>
      <%= render partial: "story", locals: { story: @stories.first, dish: @stories.first.dish || @current_restaurant&.dishes&.first } %>
---
SELECT "stories".* FROM "stories" WHERE "stories"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1 ORDER BY "dishes"."id" ASC LIMIT $2  [["restaurant_id", 1], ["LIMIT", 1]]