app/views/stories/new.html.erb

SELECT "dishes".* FROM "dishes"
---
      <%= form.label :dish_id, "Dish (Optional - for customization)" %>
      <%= form.collection_select :dish_id, Dish.all, :id, :name, { prompt: "Select a dish (optional)" }, { class: 'form-control' } %>