app/views/media_items/_media_item.html.erb

SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."media_item_id" IN ($1, $2, $3)  [["media_item_id", 1], ["media_item_id", 2], ["media_item_id", 3]]
---
  <div class="hotspots-container">
    <% media_item.hotspots.each do |hotspot| %>