app/views/media_items/new.html.erb

SELECT COUNT(*) FROM "media_items" WHERE "media_items"."story_id" = $1  [["story_id", 6]]
---
      <%= form.label :position %>
      <%= form.number_field :position, value: @media_item.position || (@story.media_items.count + 1), class: 'form-control' %>