app/views/dishes/_customization_panel.html.erb

SELECT "dish_ingredients".* FROM "dish_ingredients" WHERE "dish_ingredients"."dish_id" = $1  [["dish_id", 6]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
---
    <div class="customization-list">
      <% if dish.dish_ingredients.any? %>
        <% dish.dish_ingredients.includes(:ingredient).each do |dish_ingredient| %>

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 7]]
SELECT "substitutions".* FROM "substitutions" WHERE "substitutions"."ingredient_id" = $1  [["ingredient_id", 1]]
---

              <% substitutions = dish_ingredient.ingredient.substitutions.includes(:substitute_ingredient) %>