app/views/dishes/edit.html.erb

SELECT "dish_ingredients".* FROM "dish_ingredients" WHERE "dish_ingredients"."dish_id" = $1  [["dish_id", 6]]
---
    <div class="ingredients-list">
      <% @dish.dish_ingredients.includes(:ingredient).each do |dish_ingredient| %>