app/views/cart_items/index.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                  <% cart_item.customizations.each do |ingredient_id, customization| %>
                    <% ingredient = Ingredient.find_by(id: ingredient_id) %>