app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."session_id" = $1  [["session_id", "02f0c87c4adbd8d5ad95a2e1da03ce78"]]
---
  def index
    @cart_items = CartItem.for_session(session.id.to_s).includes(:dish, dish: :restaurant)

INSERT INTO "cart_items" ("session_id", "dish_id", "customizations", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @cart_item = CartItem.new(
      session_id: session.id.to_s,
      dish_id: params[:dish_id],
      customizations: params[:customizations] || {},
      quantity: params[:quantity] || 1
    )

    if @cart_item.save

SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."session_id" = $1  [["session_id", "b544845022bba6ab8563e53b0608bf52"]]
---
  def cart_count
    CartItem.for_session(session.id.to_s).sum(:quantity)