app/controllers/dishes_controller.rb

  def new
    @dish = Dish.new
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @dish = Dish.new(dish_params)
    if @dish.save
---
INSERT INTO "dishes" ("restaurant_id", "name", "description", "base_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @dish = Dish.find(params[:id])
    @restaurants = Restaurant.all
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants"

  def update
    @dish = Dish.find(params[:id])
    if @dish.update(dish_params)
---
UPDATE "dishes" SET "updated_at" = $1 WHERE "dishes"."id" = $2  [["updated_at", "2026-01-06 14:08:37.043940"], ["id", 6]]

  def customization_panel
    @dish = Dish.includes(:dish_ingredients, dish_ingredients: :ingredient).find(params[:id])
---
SELECT "dish_ingredients".* FROM "dish_ingredients" WHERE "dish_ingredients"."dish_id" = $1  [["dish_id", 6]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN ($1, $2)  [["id", 1], ["id", 3]]