app/controllers/media_items_controller.rb

  def new
    @story = Story.find(params[:story_id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @story = Story.find(params[:story_id])
    @media_item = @story.media_items.build(media_item_params)

    # Set position if not provided
    @media_item.position ||= @story.media_items.count + 1

    if @media_item.save
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "media_items" ("story_id", "media_type", "position", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["story_id", 10], ["media_type", 0], ["position", 2], ["duration", 3000], ["created_at", "2026-01-06 15:49:55.600489"], ["updated_at", "2026-01-06 15:49:55.600489"]]

  def update
    @media_item = MediaItem.find(params[:id])
    @story = @media_item.story
    if @media_item.update(media_item_params)
---
UPDATE "media_items" SET "updated_at" = $1 WHERE "media_items"."id" = $2  [["updated_at", "2026-01-06 14:08:55.916867"], ["id", 15]]