app/controllers/stories_controller.rb

  def create
    @story = Story.new(story_params)
    if @story.save
---
INSERT INTO "stories" ("dish_id", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dish_id", 6], ["position", 1], ["created_at", "2026-01-06 14:08:43.883691"], ["updated_at", "2026-01-06 14:08:43.883691"]]

  def edit
    @story = Story.find(params[:id])
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"