app/controllers/stories_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" IN (SELECT DISTINCT "stories"."restaurant_id" FROM "stories") ORDER BY "restaurants"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "restaurants" WHERE "restaurants"."id" IN (SELECT DISTINCT "stories"."restaurant_id" FROM "stories") LIMIT $1  [["LIMIT", 1]]
SELECT "stories".* FROM "stories" WHERE "stories"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."media_item_id" IN ($1, $2, $3)  [["media_item_id", 1], ["media_item_id", 2], ["media_item_id", 3]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def index
    @restaurants = Restaurant.includes(:stories).where(id: Story.select(:restaurant_id).distinct)
    @current_restaurant_id = params[:restaurant_id] || @restaurants.first&.id

    if @current_restaurant_id
      @current_restaurant = Restaurant.find(@current_restaurant_id)
      @stories = @current_restaurant.stories
        .includes(:restaurant, :dish, media_items: [:hotspots, { hotspots: :ingredient, file_attachment: :blob }])
        .with_attached_image
        .recent
        .ordered

SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."media_item_id" = $1  [["media_item_id", 15]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 1]]
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1 ORDER BY "dishes"."id" ASC LIMIT $2  [["restaurant_id", 1], ["LIMIT", 1]]
---
  def show
    @story = Story.includes(
      :restaurant,
      media_items: [:hotspots, { hotspots: :ingredient }]
    ).find(params[:id])

    # Get dish for customization (first dish of restaurant or story's dish if exists)
    @dish = @story.dish || @story.restaurant.dishes.first

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes"
SELECT "restaurants".* FROM "restaurants"
---
  def new
    @story = Story.new
    @story.restaurant_id = params[:restaurant_id] if params[:restaurant_id]
    @story.dish = Dish.find(params[:dish_id]) if params[:dish_id]
    @dishes = Dish.all
    @restaurants = Restaurant.all

INSERT INTO "stories" ("position", "created_at", "updated_at", "restaurant_id", "dish_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["position", 2], ["created_at", "2026-01-06 15:49:42.464943"], ["updated_at", "2026-01-06 15:49:42.464943"], ["restaurant_id", 1], ["dish_id", 7]]
---
  def create
    @story = Story.new(story_params)
    if @story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants"
---
  def edit
    @story = Story.find(params[:id])
    @restaurants = Restaurant.all

SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "stories" SET "updated_at" = $1 WHERE "stories"."id" = $2  [["updated_at", "2026-01-06 15:49:42.491170"], ["id", 10]]
---
  def update
    @story = Story.find(params[:id])
    if @story.update(story_params)